src/k-bench-results/k8s/dp_redis_density/dp_redis_density-3/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1704.58          ---          ---        10.65285         9.66300        22.39900        49.91900       131.31 
Gets        17044.09         7.33     17036.76        10.65769         9.59900        22.65500        50.17500       664.16 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      18748.67         7.33     17036.76        10.65725         9.59900        22.52700        50.17500       795.47 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.391        0.000
SET       8.639        5.000
SET       9.023       10.000
SET       9.215       15.000
SET       9.279       20.000
SET       9.343       25.000
SET       9.407       30.000
SET       9.471       35.000
SET       9.535       40.000
SET       9.599       45.000
SET       9.663       50.000
SET       9.663       52.500
SET       9.663       55.000
SET       9.727       57.500
SET       9.727       60.000
SET       9.791       62.500
SET       9.791       65.000
SET       9.855       67.500
SET       9.919       70.000
SET       9.919       72.500
SET      10.047       75.000
SET      10.047       76.250
SET      10.111       77.500
SET      10.175       78.750
SET      10.303       80.000
SET      10.495       81.250
SET      10.687       82.500
SET      11.071       83.750
SET      11.455       85.000
SET      11.903       86.250
SET      12.287       87.500
SET      12.543       88.125
SET      12.799       88.750
SET      13.247       89.375
SET      14.335       90.000
SET      15.999       90.625
SET      17.023       91.250
SET      17.535       91.875
SET      17.919       92.500
SET      18.175       93.125
SET      18.431       93.750
SET      18.559       94.062
SET      18.687       94.375
SET      18.687       94.688
SET      18.815       95.000
SET      18.943       95.312
SET      18.943       95.625
SET      19.071       95.938
SET      19.199       96.250
SET      19.199       96.562
SET      19.327       96.875
SET      19.327       97.031
SET      19.455       97.188
SET      19.455       97.344
SET      19.583       97.500
SET      19.583       97.656
SET      19.711       97.812
SET      19.711       97.969
SET      19.839       98.125
SET      19.967       98.281
SET      20.095       98.438
SET      20.223       98.516
SET      20.351       98.594
SET      20.479       98.672
SET      20.735       98.750
SET      21.119       98.828
SET      21.631       98.906
SET      22.271       98.984
SET      23.039       99.062
SET      23.935       99.141
SET      24.831       99.219
SET      25.343       99.258
SET      25.983       99.297
SET      26.751       99.336
SET      27.647       99.375
SET      28.543       99.414
SET      29.439       99.453
SET      30.463       99.492
SET      31.743       99.531
SET      33.023       99.570
SET      34.303       99.609
SET      34.815       99.629
SET      35.583       99.648
SET      36.351       99.668
SET      37.119       99.688
SET      37.887       99.707
SET      38.911       99.727
SET      39.679       99.746
SET      40.703       99.766
SET      41.727       99.785
SET      43.007       99.805
SET      43.519       99.814
SET      44.031       99.824
SET      44.799       99.834
SET      45.311       99.844
SET      46.079       99.854
SET      46.847       99.863
SET      47.615       99.873
SET      48.383       99.883
SET      49.151       99.893
SET      50.175       99.902
SET      50.687       99.907
SET      51.199       99.912
SET      51.711       99.917
SET      52.479       99.922
SET      52.991       99.927
SET      53.503       99.932
SET      54.271       99.937
SET      54.783       99.941
SET      55.551       99.946
SET      56.319       99.951
SET      56.831       99.954
SET      57.087       99.956
SET      57.599       99.958
SET      58.111       99.961
SET      58.623       99.963
SET      58.879       99.966
SET      59.391       99.968
SET      59.903       99.971
SET      60.415       99.973
SET      61.183       99.976
SET      61.439       99.977
SET      61.695       99.978
SET      61.951       99.979
SET      62.463       99.980
SET      62.719       99.982
SET      62.975       99.983
SET      63.231       99.984
SET      63.743       99.985
SET      64.511       99.987
SET      64.767       99.988
SET      65.023       99.988
SET      65.279       99.989
SET      65.535       99.990
SET      66.047       99.990
SET      66.559       99.991
SET      66.559       99.991
SET      67.071       99.992
SET      68.095       99.993
SET      68.607       99.993
SET      69.119       99.994
SET      69.631       99.994
SET      70.143       99.995
SET      70.143       99.995
SET      70.655       99.995
SET      71.167       99.995
SET      71.167       99.996
SET      71.679       99.996
SET      71.679       99.996
SET      72.191       99.997
SET      72.703       99.997
SET      73.727       99.997
SET      73.727       99.997
SET      74.239       99.997
SET      75.263       99.998
SET      75.775       99.998
SET      76.287       99.998
SET      76.799       99.998
SET      77.311       99.998
SET      77.823       99.998
SET      78.335       99.998
SET      79.871       99.999
SET      79.871       99.999
SET      79.871       99.999
SET      80.383       99.999
SET      81.407       99.999
SET      81.919       99.999
SET      81.919       99.999
SET      81.919       99.999
SET      82.431       99.999
SET      84.479       99.999
SET      84.479       99.999
SET      84.479       99.999
SET      87.039       99.999
SET      87.039       99.999
SET      88.063       99.999
SET      88.063       99.999
SET      88.063      100.000
SET      88.575      100.000
SET      88.575      100.000
SET      91.647      100.000
SET      91.647      100.000
SET      91.647      100.000
[...]
SET      93.695      100.000
SET      93.695      100.000
SET      93.695      100.000
[...]
SET      96.255      100.000
SET      96.255      100.000
SET      96.255      100.000
[...]
SET     103.423      100.000
SET     103.423      100.000
---
GET       1.215        0.000
GET       8.639        5.000
GET       9.023       10.000
GET       9.215       15.000
GET       9.279       20.000
GET       9.343       25.000
GET       9.407       30.000
GET       9.471       35.000
GET       9.535       40.000
GET       9.599       45.000
GET       9.599       50.000
GET       9.663       52.500
GET       9.663       55.000
GET       9.727       57.500
GET       9.727       60.000
GET       9.791       62.500
GET       9.791       65.000
GET       9.855       67.500
GET       9.855       70.000
GET       9.919       72.500
GET      10.047       75.000
GET      10.047       76.250
GET      10.111       77.500
GET      10.175       78.750
GET      10.303       80.000
GET      10.495       81.250
GET      10.687       82.500
GET      11.071       83.750
GET      11.455       85.000
GET      11.903       86.250
GET      12.287       87.500
GET      12.543       88.125
GET      12.863       88.750
GET      13.311       89.375
GET      14.463       90.000
GET      16.127       90.625
GET      17.023       91.250
GET      17.535       91.875
GET      17.919       92.500
GET      18.175       93.125
GET      18.431       93.750
GET      18.559       94.062
GET      18.687       94.375
GET      18.687       94.688
GET      18.815       95.000
GET      18.943       95.312
GET      18.943       95.625
GET      19.071       95.938
GET      19.199       96.250
GET      19.199       96.562
GET      19.327       96.875
GET      19.327       97.031
GET      19.455       97.188
GET      19.455       97.344
GET      19.583       97.500
GET      19.583       97.656
GET      19.711       97.812
GET      19.711       97.969
GET      19.839       98.125
GET      19.967       98.281
GET      20.095       98.438
GET      20.223       98.516
GET      20.351       98.594
GET      20.607       98.672
GET      20.863       98.750
GET      21.247       98.828
GET      21.759       98.906
GET      22.399       98.984
GET      23.167       99.062
GET      24.063       99.141
GET      24.959       99.219
GET      25.599       99.258
GET      26.239       99.297
GET      27.007       99.336
GET      27.775       99.375
GET      28.671       99.414
GET      29.695       99.453
GET      30.719       99.492
GET      31.871       99.531
GET      33.023       99.570
GET      34.303       99.609
GET      35.071       99.629
GET      35.839       99.648
GET      36.607       99.668
GET      37.375       99.688
GET      38.143       99.707
GET      39.167       99.727
GET      39.935       99.746
GET      40.959       99.766
GET      41.983       99.785
GET      43.007       99.805
GET      43.519       99.814
GET      44.287       99.824
GET      44.799       99.834
GET      45.567       99.844
GET      46.079       99.854
GET      46.847       99.863
GET      47.871       99.873
GET      48.639       99.883
GET      49.407       99.893
GET      50.431       99.902
GET      50.943       99.907
GET      51.455       99.912
GET      51.967       99.917
GET      52.479       99.922
GET      52.991       99.927
GET      53.759       99.932
GET      54.271       99.937
GET      55.039       99.941
GET      55.551       99.946
GET      56.319       99.951
GET      56.831       99.954
GET      57.343       99.956
GET      57.855       99.958
GET      58.111       99.961
GET      58.623       99.963
GET      59.135       99.966
GET      59.647       99.968
GET      60.159       99.971
GET      60.927       99.973
GET      61.439       99.976
GET      61.695       99.977
GET      62.207       99.978
GET      62.463       99.979
GET      62.975       99.980
GET      63.231       99.982
GET      63.743       99.983
GET      63.999       99.984
GET      64.511       99.985
GET      65.023       99.987
GET      65.535       99.988
GET      66.047       99.988
GET      66.047       99.989
GET      66.559       99.990
GET      66.559       99.990
GET      67.071       99.991
GET      67.583       99.991
GET      67.583       99.992
GET      68.095       99.993
GET      68.607       99.993
GET      69.119       99.994
GET      69.119       99.994
GET      69.631       99.995
GET      69.631       99.995
GET      70.143       99.995
GET      70.655       99.995
GET      70.655       99.996
GET      71.167       99.996
GET      71.679       99.996
GET      72.191       99.997
GET      72.703       99.997
GET      72.703       99.997
GET      73.215       99.997
GET      73.215       99.997
GET      73.727       99.998
GET      74.239       99.998
GET      74.239       99.998
GET      74.751       99.998
GET      75.263       99.998
GET      75.775       99.998
GET      76.287       99.998
GET      76.287       99.999
GET      76.799       99.999
GET      76.799       99.999
GET      77.311       99.999
GET      77.311       99.999
GET      77.823       99.999
GET      78.335       99.999
GET      78.335       99.999
GET      78.847       99.999
GET      79.871       99.999
GET      80.383       99.999
GET      80.383       99.999
GET      80.895       99.999
GET      81.407       99.999
GET      81.407       99.999
GET      82.431       99.999
GET      82.943      100.000
GET      83.967      100.000
GET      87.039      100.000
GET      87.551      100.000
GET      88.063      100.000
GET      89.087      100.000
GET      89.087      100.000
GET      90.623      100.000
GET      91.135      100.000
GET      91.647      100.000
GET      92.159      100.000
GET      92.671      100.000
GET      92.671      100.000
GET      93.183      100.000
GET      93.183      100.000
GET      93.695      100.000
GET      94.207      100.000
GET      94.207      100.000
GET      94.207      100.000
GET      94.719      100.000
GET      94.719      100.000
GET      95.231      100.000
GET      95.231      100.000
GET      95.743      100.000
GET      95.743      100.000
GET      95.743      100.000
[...]
GET      96.767      100.000
GET      96.767      100.000
GET      97.279      100.000
GET      97.279      100.000
GET      97.791      100.000
GET      97.791      100.000
GET     102.911      100.000
GET     102.911      100.000
GET     102.911      100.000
[...]
GET     103.423      100.000
GET     103.423      100.000
GET     103.423      100.000
[...]
GET     103.935      100.000
GET     103.935      100.000
GET     103.935      100.000
[...]
GET     104.959      100.000
GET     104.959      100.000
GET     104.959      100.000
[...]
GET     114.687      100.000
GET     114.687      100.000
---
WAIT      0.000      100.000